; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-13)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city5)
	(fuel-level plane1 fl1)
	(at plane2 city17)
	(fuel-level plane2 fl5)
	(at plane3 city4)
	(fuel-level plane3 fl3)
	(at plane4 city8)
	(fuel-level plane4 fl2)
	(at plane5 city19)
	(fuel-level plane5 fl0)
	(at plane6 city6)
	(fuel-level plane6 fl6)
	(at person1 city10)
	(at person2 city13)
	(at person3 city19)
	(at person4 city16)
	(at person5 city21)
	(at person6 city21)
	(at person7 city3)
	(at person8 city10)
	(at person9 city13)
	(at person10 city14)
	(at person11 city0)
	(at person12 city3)
	(at person13 city9)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane4 city7)
	(at person1 city19)
	(at person2 city5)
	(at person3 city8)
	(at person4 city10)
	(at person5 city10)
	(at person6 city3)
	(at person7 city17)
	(at person8 city7)
	(at person9 city6)
	(at person11 city5)
	(at person12 city19)
	(at person13 city16)
	))

)

; plan
1. (fly plane6 city6 city0 fl6 fl5)
   deleted: (at plane6 city6) (fuel-level plane6 fl6)
   added: (at plane6 city0) (fuel-level plane6 fl5)
   goals met: 0 of 13
2. (board person11 plane6 city0)
   deleted: (at person11 city0)
   added: (in person11 plane6)
   goals met: 0 of 13
3. (zoom plane6 city0 city5 fl5 fl4 fl3)
   deleted: (at plane6 city0) (fuel-level plane6 fl5)
   added: (at plane6 city5) (fuel-level plane6 fl3)
   goals met: 0 of 13
4. (debark person11 plane6 city5)
   deleted: (in person11 plane6)
   added: (at person11 city5)
   goals met: 1 of 13
5. (board person3 plane5 city19)
   deleted: (at person3 city19)
   added: (in person3 plane5)
   goals met: 1 of 13
6. (refuel plane5 city19 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 1 of 13
7. (fly plane5 city19 city8 fl1 fl0)
   deleted: (at plane5 city19) (fuel-level plane5 fl1)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 1 of 13
8. (debark person3 plane5 city8)
   deleted: (in person3 plane5)
   added: (at person3 city8)
   goals met: 2 of 13
9. (zoom plane4 city8 city7 fl2 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl2)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 3 of 13
10. (fly plane1 city5 city10 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 3 of 13
11. (zoom plane2 city17 city13 fl5 fl4 fl3)
   deleted: (at plane2 city17) (fuel-level plane2 fl5)
   added: (at plane2 city13) (fuel-level plane2 fl3)
   goals met: 3 of 13
12. (board person9 plane2 city13)
   deleted: (at person9 city13)
   added: (in person9 plane2)
   goals met: 3 of 13
13. (zoom plane2 city13 city21 fl3 fl2 fl1)
   deleted: (at plane2 city13) (fuel-level plane2 fl3)
   added: (at plane2 city21) (fuel-level plane2 fl1)
   goals met: 3 of 13
14. (board person6 plane2 city21)
   deleted: (at person6 city21)
   added: (in person6 plane2)
   goals met: 3 of 13
15. (board person5 plane2 city21)
   deleted: (at person5 city21)
   added: (in person5 plane2)
   goals met: 3 of 13
16. (board person8 plane1 city10)
   deleted: (at person8 city10)
   added: (in person8 plane1)
   goals met: 3 of 13
17. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 13
18. (board person1 plane1 city10)
   deleted: (at person1 city10)
   added: (in person1 plane1)
   goals met: 3 of 13
19. (fly plane1 city10 city19 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city19) (fuel-level plane1 fl0)
   goals met: 3 of 13
20. (refuel plane1 city19 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 13
21. (debark person1 plane1 city19)
   deleted: (in person1 plane1)
   added: (at person1 city19)
   goals met: 4 of 13
22. (fly plane1 city19 city7 fl1 fl0)
   deleted: (at plane1 city19) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 4 of 13
23. (debark person8 plane1 city7)
   deleted: (in person8 plane1)
   added: (at person8 city7)
   goals met: 5 of 13
24. (fly plane2 city21 city10 fl1 fl0)
   deleted: (at plane2 city21) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 5 of 13
25. (zoom plane3 city4 city13 fl3 fl2 fl1)
   deleted: (at plane3 city4) (fuel-level plane3 fl3)
   added: (at plane3 city13) (fuel-level plane3 fl1)
   goals met: 5 of 13
26. (board person2 plane3 city13)
   deleted: (at person2 city13)
   added: (in person2 plane3)
   goals met: 5 of 13
27. (fly plane3 city13 city5 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 5 of 13
28. (zoom plane6 city5 city16 fl3 fl2 fl1)
   deleted: (at plane6 city5) (fuel-level plane6 fl3)
   added: (at plane6 city16) (fuel-level plane6 fl1)
   goals met: 5 of 13
29. (board person4 plane6 city16)
   deleted: (at person4 city16)
   added: (in person4 plane6)
   goals met: 5 of 13
30. (debark person2 plane3 city5)
   deleted: (in person2 plane3)
   added: (at person2 city5)
   goals met: 6 of 13
31. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 13
32. (fly plane6 city16 city10 fl1 fl0)
   deleted: (at plane6 city16) (fuel-level plane6 fl1)
   added: (at plane6 city10) (fuel-level plane6 fl0)
   goals met: 6 of 13
33. (debark person4 plane6 city10)
   deleted: (in person4 plane6)
   added: (at person4 city10)
   goals met: 7 of 13
34. (debark person5 plane2 city10)
   deleted: (in person5 plane2)
   added: (at person5 city10)
   goals met: 8 of 13
35. (fly plane2 city10 city3 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 8 of 13
36. (refuel plane6 city10 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 8 of 13
37. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 13
38. (board person7 plane2 city3)
   deleted: (at person7 city3)
   added: (in person7 plane2)
   goals met: 8 of 13
39. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   goals met: 9 of 13
40. (board person12 plane2 city3)
   deleted: (at person12 city3)
   added: (in person12 plane2)
   goals met: 9 of 13
41. (fly plane6 city10 city9 fl1 fl0)
   deleted: (at plane6 city10) (fuel-level plane6 fl1)
   added: (at plane6 city9) (fuel-level plane6 fl0)
   goals met: 9 of 13
42. (board person13 plane6 city9)
   deleted: (at person13 city9)
   added: (in person13 plane6)
   goals met: 9 of 13
43. (refuel plane6 city9 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 9 of 13
44. (fly plane6 city9 city16 fl1 fl0)
   deleted: (at plane6 city9) (fuel-level plane6 fl1)
   added: (at plane6 city16) (fuel-level plane6 fl0)
   goals met: 9 of 13
45. (debark person13 plane6 city16)
   deleted: (in person13 plane6)
   added: (at person13 city16)
   goals met: 10 of 13
46. (fly plane2 city3 city17 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city17) (fuel-level plane2 fl0)
   goals met: 10 of 13
47. (refuel plane2 city17 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 13
48. (debark person7 plane2 city17)
   deleted: (in person7 plane2)
   added: (at person7 city17)
   goals met: 11 of 13
49. (fly plane2 city17 city19 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl1)
   added: (at plane2 city19) (fuel-level plane2 fl0)
   goals met: 11 of 13
50. (refuel plane2 city19 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 13
51. (debark person12 plane2 city19)
   deleted: (in person12 plane2)
   added: (at person12 city19)
   goals met: 12 of 13
52. (fly plane2 city19 city6 fl1 fl0)
   deleted: (at plane2 city19) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 12 of 13
53. (debark person9 plane2 city6)
   deleted: (in person9 plane2)
   added: (at person9 city6)
   goals met: 13 of 13
